MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F115H8TH/mcu.h
/**
 *******************************************************************************
 * @file  HC32F115H8TH.h
 * @brief Headerfile for HC32F115H8TH series MCU
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-03-15       CDT             First version
   2024-06-30       CDT             Update base upon RM Rev1.00
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2024, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 **/

#ifndef __HC32F115H8TH_H__
#define __HC32F115H8TH_H__

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Configuration of the Cortex-M0+ Processor and Core Peripherals
 ******************************************************************************/
#define __MPU_PRESENT             0       /*!< HC32F115H8TH does not provide MPU                        */
#define __VTOR_PRESENT            1       /*!< HC32F115H8TH supported vector table registers            */
#define __NVIC_PRIO_BITS          2       /*!< HC32F115H8TH uses 2 Bits for the Priority Levels         */
#define __Vendor_SysTickConfig    0       /*!< Set to 1 if different SysTick Config is used         */

/*******************************************************************************
 * Interrupt Number Definition
 ******************************************************************************/
typedef enum {
    NMI_IRQn                    = -14, /*  2 Non Maskable                            */
    HardFault_IRQn              = -13, /*  3 Hard Fault                              */
    SVC_IRQn                    = -5,  /* 11 SV Call                                 */
    PendSV_IRQn                 = -2,  /* 14 Pend SV                                 */
    SysTick_IRQn                = -1,  /* 15 System Tick                             */
    EXTINT00_IRQn               = 0,
    EXTINT01_IRQn               = 1,
    EXTINT02_IRQn               = 2,
    EXTINT03_IRQn               = 3,
    EXTINT04_IRQn               = 4,
    EXTINT05_IRQn               = 5,
    EXTINT06_IRQn               = 6,
    EXTINT07_IRQn               = 7,
    INT008_IRQn                 = 8,
    INT009_IRQn                 = 9,
    INT010_IRQn                 = 10,
    INT011_IRQn                 = 11,
    INT012_IRQn                 = 12,
    INT013_IRQn                 = 13,
    INT014_IRQn                 = 14,
    INT015_IRQn                 = 15,
    INT016_IRQn                 = 16,
    INT017_IRQn                 = 17,
    INT018_IRQn                 = 18,
    INT019_IRQn                 = 19,
    INT020_IRQn                 = 20,
    INT021_IRQn                 = 21,
    INT022_IRQn                 = 22,
    INT023_IRQn                 = 23,
    INT024_IRQn                 = 24,
    INT025_IRQn                 = 25,
    INT026_IRQn                 = 26,
    INT027_IRQn                 = 27,
    INT028_IRQn                 = 28,
    INT029_IRQn                 = 29,
    INT030_IRQn                 = 30,
    INT031_IRQn                 = 31,
} IRQn_Type;

#include <core_cm0plus.h>
#include <stdint.h>

/**
 *******************************************************************************
 ** \brief Event number enumeration
 ******************************************************************************/
typedef enum {
    EVT_SRC_PORT_EIRQ0          = 0U,   /* PORT_EIRQ0   */
    EVT_SRC_PORT_EIRQ8          = 1U,   /* PORT_EIRQ8   */
    EVT_SRC_TMRB_7_OVF          = 8U,   /* TMRB_7_OVF   */
    EVT_SRC_TMRB_7_UDF          = 9U,   /* TMRB_7_UDF   */
    EVT_SRC_TMRB_8_CMP          = 10U,  /* TMRB_8_CMP   */
    EVT_SRC_PORT_EIRQ1          = 16U,  /* PORT_EIRQ1   */
    EVT_SRC_PORT_EIRQ9          = 17U,  /* PORT_EIRQ9   */
    EVT_SRC_TMRB_8_OVF          = 24U,  /* TMRB_8_OVF   */
    EVT_SRC_TMRB_8_UDF          = 25U,  /* TMRB_8_UDF   */
    EVT_SRC_TMRB_7_CMP          = 26U,  /* TMRB_7_CMP   */
    EVT_SRC_PORT_EIRQ2          = 32U,  /* PORT_EIRQ2   */
    EVT_SRC_TMRB_5_OVF          = 40U,  /* TMRB_5_OVF   */
    EVT_SRC_TMRB_5_UDF          = 41U,  /* TMRB_5_UDF   */
    EVT_SRC_TMRB_6_CMP          = 42U,  /* TMRB_6_CMP   */
    EVT_SRC_PORT_EIRQ3          = 48U,  /* PORT_EIRQ3   */
    EVT_SRC_TMR0_CMP_A          = 50U,  /* TMR0_GCMP    */
    EVT_SRC_TMRB_6_OVF          = 56U,  /* TMRB_6_OVF   */
    EVT_SRC_TMRB_6_UDF          = 57U,  /* TMRB_6_UDF   */
    EVT_SRC_TMRB_5_CMP          = 58U,  /* TMRB_5_CMP   */
    EVT_SRC_AOS_STRG            = 59U,  /* EVENT_STRG   */
    EVT_SRC_PORT_EIRQ4          = 64U,  /* PORT_EIRQ4   */
    EVT_SRC_TMRB_3_OVF          = 72U,  /* TMRB_3_OVF   */
    EVT_SRC_TMRB_3_UDF          = 73U,  /* TMRB_3_UDF   */
    EVT_SRC_TMRB_4_CMP          = 74U,  /* TMRB_4_CMP   */
    EVT_SRC_ADC_EOCA            = 75U,  /* ADC_EOCA     */
    EVT_SRC_PORT_EIRQ5          = 80U,  /* PORT_EIRQ5   */
    EVT_SRC_TMRB_4_OVF          = 88U,  /* TMRB_4_OVF   */
    EVT_SRC_TMRB_4_UDF          = 89U,  /* TMRB_4_UDF   */
    EVT_SRC_TMRB_3_CMP          = 90U,  /* TMRB_3_CMP   */
    EVT_SRC_ADC_EOCB            = 91U,  /* ADC_EOCB     */
    EVT_SRC_PORT_EIRQ6          = 96U,  /* PORT_EIRQ6   */
    EVT_SRC_TMRB_1_OVF          = 104U, /* TMRB_1_OVF   */
    EVT_SRC_TMRB_1_UDF          = 105U, /* TMRB_1_UDF   */
    EVT_SRC_TMRB_2_CMP          = 106U, /* TMRB_2_CMP   */
    EVT_SRC_ADC_CMP0            = 107U, /* ADC_CMP0     */
    EVT_SRC_PORT_EIRQ7          = 112U, /* PORT_EIRQ7   */
    EVT_SRC_EFM_OPTEND          = 116U, /* EFM_OPTEND   */
    EVT_SRC_RTC_ALM             = 117U, /* RTC_ALM      */
    EVT_SRC_RTC_PRD             = 118U, /* RTC_PRD      */
    EVT_SRC_TMRB_2_OVF          = 120U, /* TMRB_2_OVF   */
    EVT_SRC_TMRB_2_UDF          = 121U, /* TMRB_2_UDF   */
    EVT_SRC_TMRB_1_CMP          = 122U, /* TMRB_1_CMP   */
    EVT_SRC_ADC_CMP1            = 123U, /* ADC_CMP1     */
    EVT_SRC_MAX                 = 127U,
} en_event_src_t;

/**
 *******************************************************************************
 ** \brief Interrupt number enumeration
 ******************************************************************************/
typedef enum {
    INT_SRC_PORT_EIRQ0          = 0U,   /* PORT_EIRQ0   */
    INT_SRC_PORT_EIRQ8          = 1U,   /* PORT_EIRQ8   */
    INT_SRC_EFM_PEERR           = 4U,   /* EFM_PEERR    */
    INT_SRC_EFM_RDCOL           = 5U,   /* EFM_RDCOL    */
    INT_SRC_XTAL_STOP           = 6U,   /* XTAL_STOP    */
    INT_SRC_SWDT_NMIUNDF        = 7U,   /* SWDT_NMIUNDF */
    INT_SRC_TMRB_7_OVF          = 8U,   /* TMRB_7_OVF   */
    INT_SRC_TMRB_7_UDF          = 9U,   /* TMRB_7_UDF   */
    INT_SRC_TMRB_8_CMP          = 10U,  /* TMRB_8_CMP   */
    INT_SRC_USART1_EI           = 12U,  /* USART_1_EI   */
    INT_SRC_I2C_EEI             = 13U,  /* IIC_EE1      */
    INT_SRC_SPI_SPEI            = 14U,  /* SPI_SPEI     */
    INT_SRC_USART4_EI           = 15U,  /* USART_4_EI   */
    INT_SRC_PORT_EIRQ1          = 16U,  /* PORT_EIRQ1   */
    INT_SRC_PORT_EIRQ9          = 17U,  /* PORT_EIRQ9   */
    INT_SRC_CTC_ERR             = 20U,  /* CTC_ERR      */
    INT_SRC_TMRB_8_OVF          = 24U,  /* TMRB_8_OVF   */
    INT_SRC_TMRB_8_UDF          = 25U,  /* TMRB_8_UDF   */
    INT_SRC_TMRB_7_CMP          = 26U,  /* TMRB_7_CMP   */
    INT_SRC_USART1_RI           = 28U,  /* USART_1_RI   */
    INT_SRC_USART4_RI           = 31U,  /* USART_4_RI   */
    INT_SRC_PORT_EIRQ2          = 32U,  /* PORT_EIRQ2   */
    INT_SRC_TMRB_5_OVF          = 40U,  /* TMRB_5_OVF   */
    INT_SRC_TMRB_5_UDF          = 41U,  /* TMRB_5_UDF   */
    INT_SRC_TMRB_6_CMP          = 42U,  /* TMRB_6_CMP   */
    INT_SRC_USART1_TI           = 44U,  /* USART_1_TI   */
    INT_SRC_USART3_EI           = 45U,  /* USART_3_EI   */
    INT_SRC_PORT_EIRQ3          = 48U,  /* PORT_EIRQ3   */
    INT_SRC_PORT_EKEY           = 49U,  /* PORT_EKEY    */
    INT_SRC_TMR0_CMP_A          = 50U,  /* TMR0_GCMP    */
    INT_SRC_TMRB_6_OVF          = 56U,  /* TMRB_6_OVF   */
    INT_SRC_TMRB_6_UDF          = 57U,  /* TMRB_6_UDF   */
    INT_SRC_TMRB_5_CMP          = 58U,  /* TMRB_5_CMP   */
    INT_SRC_USART1_TCI          = 60U,  /* USART_1_TCI  */
    INT_SRC_USART3_RI           = 61U,  /* USART_3_RI   */
    INT_SRC_SPI_SPRI            = 62U,  /* SPI_SPRI     */
    INT_SRC_PORT_EIRQ4          = 64U,  /* PORT_EIRQ4   */
    INT_SRC_TMRB_3_OVF          = 72U,  /* TMRB_3_OVF   */
    INT_SRC_TMRB_3_UDF          = 73U,  /* TMRB_3_UDF   */
    INT_SRC_TMRB_4_CMP          = 74U,  /* TMRB_4_CMP   */
    INT_SRC_ADC_EOCA            = 75U,  /* ADC_EOCA     */
    INT_SRC_USART2_EI           = 76U,  /* USART_2_EI   */
    INT_SRC_USART3_TI           = 77U,  /* USART_3_TI   */
    INT_SRC_I2C_TEI             = 78U,  /* IIC_TEI      */
    INT_SRC_SPI_SPII            = 79U,  /* SPI_SPII     */
    INT_SRC_PORT_EIRQ5          = 80U,  /* PORT_EIRQ5   */
    INT_SRC_TMRB_4_OVF          = 88U,  /* TMRB_4_OVF   */
    INT_SRC_TMRB_4_UDF          = 89U,  /* TMRB_4_UDF   */
    INT_SRC_TMRB_3_CMP          = 90U,  /* TMRB_3_CMP   */
    INT_SRC_ADC_EOCB            = 91U,  /* ADC_EOCB     */
    INT_SRC_USART2_RI           = 92U,  /* USART_2_RI   */
    INT_SRC_USART3_TCI          = 93U,  /* USART_3_TCI  */
    INT_SRC_I2C_RXI             = 94U,  /* IIC_RXI      */
    INT_SRC_PORT_EIRQ6          = 96U,  /* PORT_EIRQ6   */
    INT_SRC_TMRB_1_OVF          = 104U, /* TMRB_1_OVF   */
    INT_SRC_TMRB_1_UDF          = 105U, /* TMRB_1_UDF   */
    INT_SRC_TMRB_2_CMP          = 106U, /* TMRB_2_CMP   */
    INT_SRC_ADC_CMP0            = 107U, /* ADC_CMP0     */
    INT_SRC_USART2_TI           = 108U, /* USART_2_TI   */
    INT_SRC_I2C_TXI             = 109U, /* IIC_TXI      */
    INT_SRC_USART4_TI           = 111U, /* USART_4_TI   */
    INT_SRC_PORT_EIRQ7          = 112U, /* PORT_EIRQ7   */
    INT_SRC_LVD                 = 114U, /* LVD_DET      */
    INT_SRC_EFM_OPTEND          = 116U, /* EFM_OPTEND   */
    INT_SRC_RTC_ALM             = 117U, /* RTC_ALM      */
    INT_SRC_RTC_PRD             = 118U, /* RTC_PRD      */
    INT_SRC_RTC_IT              = 119U, /* RTC_IT       */
    INT_SRC_TMRB_2_OVF          = 120U, /* TMRB_2_OVF   */
    INT_SRC_TMRB_2_UDF          = 121U, /* TMRB_2_UDF   */
    INT_SRC_TMRB_1_CMP          = 122U, /* TMRB_1_CMP   */
    INT_SRC_ADC_CMP1            = 123U, /* ADC_CMP1     */
    INT_SRC_USART2_TCI          = 124U, /* USART_2_TCI  */
    INT_SRC_SPI_SPTI            = 125U, /* SPI_SPTI     */
    INT_SRC_USART4_TCI          = 127U, /* USART_4_TCI  */
    INT_SRC_MAX                 = 127U,
} en_int_src_t;

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

/**
 * @brief ADC
 */
typedef struct {
    __IO uint8_t  STR;
    uint8_t RESERVED0[1];
    __IO uint16_t CR0;
    __IO uint16_t CR1;
    uint8_t RESERVED1[4];
    __IO uint16_t TRGSR;
    __IO uint32_t CHSELRA;
    __IO uint32_t CHSELRB;
    uint8_t RESERVED2[4];
    __IO uint8_t  EXCHSELR;
    uint8_t RESERVED3[7];
    __IO uint8_t  SSTR;
    uint8_t RESERVED4[35];
    __I  uint8_t  ISR;
    __IO uint8_t  ICR;
    __O  uint8_t  ISCLRR;
    uint8_t RESERVED5[9];
    __I  uint16_t DR0;
    __I  uint16_t DR1;
    __I  uint16_t DR2;
    __I  uint16_t DR3;
    __I  uint16_t DR4;
    __I  uint16_t DR5;
    __I  uint16_t DR6;
    __I  uint16_t DR7;
    __I  uint16_t DR8;
    __I  uint16_t DR9;
    __I  uint16_t DR10;
    __I  uint16_t DR11;
    uint8_t RESERVED6[56];
    __IO uint16_t AWDCR;
    __I  uint8_t  AWDSR;
    __O  uint8_t  AWDSCLRR;
    __IO uint16_t AWD0DR0;
    __IO uint16_t AWD0DR1;
    __IO uint8_t  AWD0CHSR;
    uint8_t RESERVED7[3];
    __IO uint16_t AWD1DR0;
    __IO uint16_t AWD1DR1;
    __IO uint8_t  AWD1CHSR;
} CM_ADC_TypeDef;

/**
 * @brief AOS
 */
typedef struct {
    __O  uint32_t INTC_SFTTRG;
    uint8_t RESERVED0[28];
    __IO uint32_t TMR0_TRGSEL;
    uint8_t RESERVED1[44];
    __IO uint32_t TMRB_TRGSEL;
    uint8_t RESERVED2[12];
    __IO uint32_t ADC_TRGSEL0;
    __IO uint32_t ADC_TRGSEL1;
} CM_AOS_TypeDef;

/**
 * @brief CMU
 */
typedef struct {
    __IO uint8_t  PERICKSEL;
    uint8_t RESERVED0[3];
    __IO uint8_t  XTALSTDSR;
    uint8_t RESERVED1[3];
    __IO uint8_t  SCKDIVR;
    uint8_t RESERVED2[3];
    __IO uint8_t  CKSWR;
    uint8_t RESERVED3[3];
    __IO uint8_t  XTALCR;
    uint8_t RESERVED4[3];
    __IO uint8_t  XTALCFGR;
    __IO uint8_t  XTALSTBCR;
    uint8_t RESERVED5[2];
    __IO uint8_t  HRCCR;
    uint8_t RESERVED6[7];
    __I  uint8_t  OSCSTBSR;
    uint8_t RESERVED7[3];
    __IO uint8_t  MCO1CFGR;
    uint8_t RESERVED8[3];
    __IO uint8_t  XTALSTDCR;
    uint8_t RESERVED9[7];
    __IO uint32_t FCG;
    __IO uint8_t  XTAL32CR;
    uint8_t RESERVED10[3];
    __IO uint8_t  XTAL32CFGR;
    __IO uint8_t  XTAL32NFR;
    uint8_t RESERVED11[2];
    __IO uint8_t  LRCCR;
} CM_CMU_TypeDef;

/**
 * @brief CRC
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t RESLT;
    uint8_t RESERVED0[120];
    __IO uint32_t DAT0;
    __IO uint32_t DAT1;
    __IO uint32_t DAT2;
    __IO uint32_t DAT3;
    __IO uint32_t DAT4;
    __IO uint32_t DAT5;
    __IO uint32_t DAT6;
    __IO uint32_t DAT7;
    __IO uint32_t DAT8;
    __IO uint32_t DAT9;
    __IO uint32_t DAT10;
    __IO uint32_t DAT11;
    __IO uint32_t DAT12;
    __IO uint32_t DAT13;
    __IO uint32_t DAT14;
    __IO uint32_t DAT15;
    __IO uint32_t DAT16;
    __IO uint32_t DAT17;
    __IO uint32_t DAT18;
    __IO uint32_t DAT19;
    __IO uint32_t DAT20;
    __IO uint32_t DAT21;
    __IO uint32_t DAT22;
    __IO uint32_t DAT23;
    __IO uint32_t DAT24;
    __IO uint32_t DAT25;
    __IO uint32_t DAT26;
    __IO uint32_t DAT27;
    __IO uint32_t DAT28;
    __IO uint32_t DAT29;
    __IO uint32_t DAT30;
    __IO uint32_t DAT31;
} CM_CRC_TypeDef;

/**
 * @brief CTC
 */
typedef struct {
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __I  uint32_t STR;
} CM_CTC_TypeDef;

/**
 * @brief DBGC
 */
typedef struct {
    __IO uint32_t MCUDBGSTAT;
    __IO uint32_t MCUSTPCTL;
} CM_DBGC_TypeDef;

/**
 * @brief EFM
 */
typedef struct {
    __IO uint32_t FAPRT;
    __IO uint32_t FSTP;
    __IO uint32_t FRMC;
    __IO uint32_t FWMC;
    __I  uint32_t FSR;
    __IO uint32_t FSCLR;
    __IO uint32_t FITE;
    uint8_t RESERVED0[4];
    __IO uint32_t FPMTSW;
    __IO uint32_t FPMTEW;
    uint8_t RESERVED1[40];
    __I  uint32_t UQID0;
    __I  uint32_t UQID1;
    __I  uint32_t UQID2;
    uint8_t RESERVED2[550];
    __IO uint8_t  HRCCFGR;
    uint8_t RESERVED3[1];
    __IO uint16_t LVDICGCR;
} CM_EFM_TypeDef;

/**
 * @brief GPIO
 */
typedef struct {
    __I  uint8_t  PIDR0;
    __I  uint8_t  PIDR1;
    __I  uint8_t  PIDR2;
    __I  uint8_t  PIDR3;
    __I  uint8_t  PIDR4;
    __I  uint8_t  PIDR5;
    __I  uint8_t  PIDR6;
    __I  uint8_t  PIDR7;
    uint8_t RESERVED0[4];
    __I  uint8_t  PIDR12;
    __I  uint8_t  PIDR13;
    __I  uint8_t  PIDR14;
    uint8_t RESERVED1[1];
    __IO uint8_t  PODR0;
    __IO uint8_t  PODR1;
    __IO uint8_t  PODR2;
    __IO uint8_t  PODR3;
    __IO uint8_t  PODR4;
    __IO uint8_t  PODR5;
    __IO uint8_t  PODR6;
    __IO uint8_t  PODR7;
    uint8_t RESERVED2[4];
    __IO uint8_t  PODR12;
    __IO uint8_t  PODR13;
    __IO uint8_t  PODR14;
    uint8_t RESERVED3[1];
    __IO uint8_t  POER0;
    __IO uint8_t  POER1;
    __IO uint8_t  POER2;
    __IO uint8_t  POER3;
    __IO uint8_t  POER4;
    __IO uint8_t  POER5;
    __IO uint8_t  POER6;
    __IO uint8_t  POER7;
    uint8_t RESERVED4[4];
    __IO uint8_t  POER12;
    __IO uint8_t  POER13;
    __IO uint8_t  POER14;
    uint8_t RESERVED5[1];
    __O  uint8_t  POSR0;
    __O  uint8_t  POSR1;
    __O  uint8_t  POSR2;
    __O  uint8_t  POSR3;
    __O  uint8_t  POSR4;
    __O  uint8_t  POSR5;
    __O  uint8_t  POSR6;
    __O  uint8_t  POSR7;
    uint8_t RESERVED6[4];
    __O  uint8_t  POSR12;
    __O  uint8_t  POSR13;
    __O  uint8_t  POSR14;
    uint8_t RESERVED7[1];
    __O  uint8_t  PORR0;
    __O  uint8_t  PORR1;
    __O  uint8_t  PORR2;
    __O  uint8_t  PORR3;
    __O  uint8_t  PORR4;
    __O  uint8_t  PORR5;
    __O  uint8_t  PORR6;
    __O  uint8_t  PORR7;
    uint8_t RESERVED8[4];
    __O  uint8_t  PORR12;
    __O  uint8_t  PORR13;
    __O  uint8_t  PORR14;
    uint8_t RESERVED9[1];
    __O  uint8_t  POTR0;
    __O  uint8_t  POTR1;
    __O  uint8_t  POTR2;
    __O  uint8_t  POTR3;
    __O  uint8_t  POTR4;
    __O  uint8_t  POTR5;
    __O  uint8_t  POTR6;
    __O  uint8_t  POTR7;
    uint8_t RESERVED10[4];
    __O  uint8_t  POTR12;
    __O  uint8_t  POTR13;
    __O  uint8_t  POTR14;
    uint8_t RESERVED11[929];
    __IO uint16_t PCR00;
    __IO uint16_t PCR01;
    uint8_t RESERVED12[12];
    __IO uint16_t PCR10;
    __IO uint16_t PCR11;
    __IO uint16_t PCR12;
    __IO uint16_t PCR13;
    __IO uint16_t PCR14;
    __IO uint16_t PCR15;
    __IO uint16_t PCR16;
    __IO uint16_t PCR17;
    __IO uint16_t PCR20;
    __IO uint16_t PCR21;
    __IO uint16_t PCR22;
    __IO uint16_t PCR23;
    __IO uint16_t PCR24;
    __IO uint16_t PCR25;
    __IO uint16_t PCR26;
    __IO uint16_t PCR27;
    __IO uint16_t PCR30;
    __IO uint16_t PCR31;
    uint8_t RESERVED13[12];
    __IO uint16_t PCR40;
    __IO uint16_t PCR41;
    uint8_t RESERVED14[12];
    __IO uint16_t PCR50;
    __IO uint16_t PCR51;
    uint8_t RESERVED15[12];
    __IO uint16_t PCR60;
    __IO uint16_t PCR61;
    __IO uint16_t PCR62;
    __IO uint16_t PCR63;
    uint8_t RESERVED16[8];
    __IO uint16_t PCR70;
    __IO uint16_t PCR71;
    __IO uint16_t PCR72;
    __IO uint16_t PCR73;
    uint8_t RESERVED17[72];
    __IO uint16_t PCR120;
    __IO uint16_t PCR121;
    __IO uint16_t PCR122;
    __IO uint16_t PCR123;
    __IO uint16_t PCR124;
    uint8_t RESERVED18[20];
    __IO uint16_t PCR137;
    uint8_t RESERVED19[12];
    __IO uint16_t PCR146;
    __IO uint16_t PCR147;
    uint8_t RESERVED20[16];
    __IO uint16_t PSPCR;
    uint8_t RESERVED21[2];
    __IO uint16_t PCCR;
    __IO uint16_t PINAER;
    __IO uint16_t PWPR;
} CM_GPIO_TypeDef;

/**
 * @brief I2C
 */
typedef struct {
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    uint8_t RESERVED0[4];
    __IO uint32_t CR4;
    __IO uint32_t SLR0;
    __IO uint32_t SLR1;
    uint8_t RESERVED1[4];
    __IO uint32_t SR;
    __O  uint32_t CLR;
    __IO uint8_t  DTR;
    uint8_t RESERVED2[3];
    __IO uint8_t  DRR;
    uint8_t RESERVED3[3];
    __IO uint32_t CCR;
    __IO uint32_t FLTR;
} CM_I2C_TypeDef;

/**
 * @brief ICG
 */
typedef struct {
    __I  uint32_t ICG0;
    __I  uint32_t ICG1;
    __I  uint32_t ICG2;
    __I  uint32_t ICG3;
    __I  uint32_t ICG4;
    __I  uint32_t ICG5;
    __I  uint32_t ICG6;
} CM_ICG_TypeDef;

/**
 * @brief INTC
 */
typedef struct {
    __IO uint32_t NMICR;
    __IO uint32_t NMIENR;
    __I  uint32_t NMIFR;
    __IO uint32_t NMICLR;
    uint8_t RESERVED0[16];
    __IO uint32_t EVTER;
    __IO uint32_t EKEYCR;
    uint8_t RESERVED1[20];
    __IO uint32_t FPRCR;
    __IO uint32_t EIRQCR0;
    __IO uint32_t EIRQCR1;
    __IO uint32_t EIRQCR2;
    __IO uint32_t EIRQCR3;
    __IO uint32_t EIRQCR4;
    __IO uint32_t EIRQCR5;
    __IO uint32_t EIRQCR6;
    __IO uint32_t EIRQCR7;
    __IO uint32_t EIRQCR8;
    __IO uint32_t EIRQCR9;
    uint8_t RESERVED2[8];
    __IO uint32_t WUPEN;
    __IO uint32_t EIRQFR;
    __IO uint32_t EIRQCLR;
    uint8_t RESERVED3[36];
    __IO uint32_t ISELAR8;
    __IO uint32_t ISELAR9;
    __IO uint32_t ISELAR10;
    __IO uint32_t ISELAR11;
    __IO uint32_t ISELAR12;
    __IO uint32_t ISELAR13;
    __IO uint32_t ISELAR14;
    __IO uint32_t ISELAR15;
    __IO uint32_t ISELAR16;
    __IO uint32_t ISELAR17;
    __IO uint32_t ISELAR18;
    __IO uint32_t ISELAR19;
    __IO uint32_t ISELAR20;
    __IO uint32_t ISELAR21;
    __IO uint32_t ISELAR22;
    __IO uint32_t ISELAR23;
    __IO uint32_t ISELBR24;
    __IO uint32_t ISELBR25;
    __IO uint32_t ISELBR26;
    __IO uint32_t ISELBR27;
    __IO uint32_t ISELBR28;
    __IO uint32_t ISELBR29;
    __IO uint32_t ISELBR30;
    __IO uint32_t ISELBR31;
} CM_INTC_TypeDef;

/**
 * @brief PWC
 */
typedef struct {
    __IO uint8_t  STPMCR;
    uint8_t RESERVED0[3];
    __IO uint8_t  PWRC;
    uint8_t RESERVED1[7];
    __IO uint8_t  RAMCR;
    uint8_t RESERVED2[3];
    __IO uint8_t  LVDCSR;
    uint8_t RESERVED3[15];
    __IO uint16_t FPRC;
    uint8_t RESERVED4[30];
    __IO uint8_t  DBGC;
} CM_PWC_TypeDef;

/**
 * @brief RMU
 */
typedef struct {
    __IO uint16_t RSTF0;
} CM_RMU_TypeDef;

/**
 * @brief RTC
 */
typedef struct {
    __IO uint8_t  CR0;
    uint8_t RESERVED0[3];
    __IO uint8_t  CR1;
    uint8_t RESERVED1[3];
    __IO uint8_t  CR2;
    uint8_t RESERVED2[3];
    __IO uint8_t  CR3;
    uint8_t RESERVED3[3];
    __IO uint8_t  SEC;
    uint8_t RESERVED4[3];
    __IO uint8_t  MIN;
    uint8_t RESERVED5[3];
    __IO uint8_t  HOUR;
    uint8_t RESERVED6[3];
    __IO uint8_t  WEEK;
    uint8_t RESERVED7[3];
    __IO uint8_t  DAY;
    uint8_t RESERVED8[3];
    __IO uint8_t  MON;
    uint8_t RESERVED9[3];
    __IO uint8_t  YEAR;
    uint8_t RESERVED10[3];
    __IO uint8_t  ALMMIN;
    uint8_t RESERVED11[3];
    __IO uint8_t  ALMHOUR;
    uint8_t RESERVED12[3];
    __IO uint8_t  ALMWEEK;
    uint8_t RESERVED13[3];
    __IO uint8_t  ERRCRH;
    uint8_t RESERVED14[3];
    __IO uint8_t  ERRCRL;
} CM_RTC_TypeDef;

/**
 * @brief SPI
 */
typedef struct {
    __IO uint32_t DR;
    __IO uint32_t CR1;
    uint8_t RESERVED0[4];
    __IO uint32_t CFG1;
    uint8_t RESERVED1[4];
    __IO uint32_t SR;
    __IO uint32_t CFG2;
} CM_SPI_TypeDef;

/**
 * @brief SWDT
 */
typedef struct {
    __IO uint32_t CR;
    __IO uint32_t SR;
    __IO uint32_t RR;
} CM_SWDT_TypeDef;

/**
 * @brief TMR0
 */
typedef struct {
    __IO uint32_t CNTAR;
    uint8_t RESERVED0[4];
    __IO uint32_t CMPAR;
    uint8_t RESERVED1[4];
    __IO uint32_t BCONR;
    __IO uint32_t STFLR;
} CM_TMR0_TypeDef;

/**
 * @brief TMRB
 */
typedef struct {
    __IO uint16_t CNTER;
    uint8_t RESERVED0[2];
    __IO uint16_t PERAR;
    uint8_t RESERVED1[58];
    __IO uint16_t CMPAR;
    uint8_t RESERVED2[62];
    __IO uint8_t  BCSTRL;
    __IO uint8_t  BCSTRH;
    uint8_t RESERVED3[2];
    __IO uint16_t HCONR;
    uint8_t RESERVED4[2];
    __IO uint16_t HCUPR;
    uint8_t RESERVED5[2];
    __IO uint16_t HCDOR;
    uint8_t RESERVED6[2];
    __IO uint16_t ICONR;
    uint8_t RESERVED7[2];
    __IO uint16_t ECONR;
    uint8_t RESERVED8[6];
    __IO uint16_t STFLR;
    uint8_t RESERVED9[98];
    __IO uint16_t CCONR;
    uint8_t RESERVED10[62];
    __IO uint16_t PCONR;
} CM_TMRB_TypeDef;

/**
 * @brief USART
 */
typedef struct {
    __I  uint32_t SR;
    __IO uint16_t TDR;
    __I  uint16_t RDR;
    __IO uint32_t BRR;
    __IO uint32_t CR1;
    __IO uint32_t CR2;
    __IO uint32_t CR3;
    __IO uint32_t PR;
} CM_USART_TypeDef;

/******************************************************************************/
/*                     Memory Base Address                                    */
/******************************************************************************/
#define EFM_BASE                             (0x00000000UL)   /*!< EFM base address in the alias region */
#define SRAM_BASE                            (0x20000000UL)   /*!< SRAM base address in the alias region */

