MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F115H8TH/mcu.h
/*******************************************************************************
                Bit definition for Peripheral EFM
*******************************************************************************/
/*  Bit definition for EFM_FAPRT register  */
#define EFM_FAPRT_FAPRT                                (0x0000FFFFUL)

/*  Bit definition for EFM_FSTP register  */
#define EFM_FSTP_FSTP                                  (0x00000001UL)

/*  Bit definition for EFM_FRMC register  */
#define EFM_FRMC_FLWT_POS                              (0U)
#define EFM_FRMC_FLWT                                  (0x00000001UL)
#define EFM_FRMC_PREFETE_POS                           (17U)
#define EFM_FRMC_PREFETE                               (0x00020000UL)

/*  Bit definition for EFM_FWMC register  */
#define EFM_FWMC_PEMODE_POS                            (0U)
#define EFM_FWMC_PEMODE                                (0x00000001UL)
#define EFM_FWMC_PEMOD_POS                             (4U)
#define EFM_FWMC_PEMOD                                 (0x00000070UL)
#define EFM_FWMC_BUSHLDCTL_POS                         (8U)
#define EFM_FWMC_BUSHLDCTL                             (0x00000100UL)

/*  Bit definition for EFM_FSR register  */
#define EFM_FSR_PEWERR_POS                             (0U)
#define EFM_FSR_PEWERR                                 (0x00000001UL)
#define EFM_FSR_PEPRTERR_POS                           (1U)
#define EFM_FSR_PEPRTERR                               (0x00000002UL)
#define EFM_FSR_PGMISMTCH_POS                          (3U)
#define EFM_FSR_PGMISMTCH                              (0x00000008UL)
#define EFM_FSR_OPTEND_POS                             (4U)
#define EFM_FSR_OPTEND                                 (0x00000010UL)
#define EFM_FSR_COLERR_POS                             (5U)
#define EFM_FSR_COLERR                                 (0x00000020UL)
#define EFM_FSR_RDY_POS                                (8U)
#define EFM_FSR_RDY                                    (0x00000100UL)

/*  Bit definition for EFM_FSCLR register  */
#define EFM_FSCLR_PEWERRCLR_POS                        (0U)
#define EFM_FSCLR_PEWERRCLR                            (0x00000001UL)
#define EFM_FSCLR_PEPRTERRCLR_POS                      (1U)
#define EFM_FSCLR_PEPRTERRCLR                          (0x00000002UL)
#define EFM_FSCLR_PGMISMTCHCLR_POS                     (3U)
#define EFM_FSCLR_PGMISMTCHCLR                         (0x00000008UL)
#define EFM_FSCLR_OPTENDCLR_POS                        (4U)
#define EFM_FSCLR_OPTENDCLR                            (0x00000010UL)
#define EFM_FSCLR_COLERRCLR_POS                        (5U)
#define EFM_FSCLR_COLERRCLR                            (0x00000020UL)

/*  Bit definition for EFM_FITE register  */
#define EFM_FITE_PEERRITE_POS                          (0U)
#define EFM_FITE_PEERRITE                              (0x00000001UL)
#define EFM_FITE_OPTENDITE_POS                         (1U)
#define EFM_FITE_OPTENDITE                             (0x00000002UL)
#define EFM_FITE_COLERRITE_POS                         (2U)
#define EFM_FITE_COLERRITE                             (0x00000004UL)

/*  Bit definition for EFM_FPMTSW register  */
#define EFM_FPMTSW_FPMTSW                              (0x0000FFFFUL)

/*  Bit definition for EFM_FPMTEW register  */
#define EFM_FPMTEW_FPMTEW                              (0x0000FFFFUL)

/*  Bit definition for EFM_UQID0 register  */
#define EFM_UQID0                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID1 register  */
#define EFM_UQID1                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_UQID2 register  */
#define EFM_UQID2                                      (0xFFFFFFFFUL)

/*  Bit definition for EFM_HRCCFGR register  */
#define EFM_HRCCFGR_HRCFREQS                           (0x0FU)
#define EFM_HRCCFGR_HRCFREQS_0                         (0x01U)
#define EFM_HRCCFGR_HRCFREQS_1                         (0x02U)
#define EFM_HRCCFGR_HRCFREQS_2                         (0x04U)
#define EFM_HRCCFGR_HRCFREQS_3                         (0x08U)

/*  Bit definition for EFM_LVDICGCR register  */
#define EFM_LVDICGCR_DFS_POS                           (0U)
#define EFM_LVDICGCR_DFS                               (0x0003U)
#define EFM_LVDICGCR_DFS_0                             (0x0001U)
#define EFM_LVDICGCR_DFS_1                             (0x0002U)
#define EFM_LVDICGCR_DFDIS_POS                         (2U)
#define EFM_LVDICGCR_DFDIS                             (0x0004U)
#define EFM_LVDICGCR_LVDLVL_POS                        (8U)
#define EFM_LVDICGCR_LVDLVL                            (0x0F00U)
#define EFM_LVDICGCR_LVDLVL_0                          (0x0100U)
#define EFM_LVDICGCR_LVDLVL_1                          (0x0200U)
#define EFM_LVDICGCR_LVDLVL_2                          (0x0400U)
#define EFM_LVDICGCR_LVDLVL_3                          (0x0800U)
#define EFM_LVDICGCR_NMIS_POS                          (12U)
#define EFM_LVDICGCR_NMIS                              (0x1000U)
#define EFM_LVDICGCR_IRS_POS                           (13U)
#define EFM_LVDICGCR_IRS                               (0x2000U)
#define EFM_LVDICGCR_IRDIS_POS                         (14U)
#define EFM_LVDICGCR_IRDIS                             (0x4000U)
#define EFM_LVDICGCR_LVDDIS_POS                        (15U)
#define EFM_LVDICGCR_LVDDIS                            (0x8000U)

/*******************************************************************************
                Bit definition for Peripheral GPIO
*******************************************************************************/
/*  Bit definition for GPIO_PIDR register  */
#define GPIO_PIDR_PIN0_POS                             (0U)
#define GPIO_PIDR_PIN0                                 (0x01U)
#define GPIO_PIDR_PIN1_POS                             (1U)
#define GPIO_PIDR_PIN1                                 (0x02U)
#define GPIO_PIDR_PIN2_POS                             (2U)
#define GPIO_PIDR_PIN2                                 (0x04U)
#define GPIO_PIDR_PIN3_POS                             (3U)
#define GPIO_PIDR_PIN3                                 (0x08U)
#define GPIO_PIDR_PIN4_POS                             (4U)
#define GPIO_PIDR_PIN4                                 (0x10U)
#define GPIO_PIDR_PIN5_POS                             (5U)
#define GPIO_PIDR_PIN5                                 (0x20U)
#define GPIO_PIDR_PIN6_POS                             (6U)
#define GPIO_PIDR_PIN6                                 (0x40U)
#define GPIO_PIDR_PIN7_POS                             (7U)
#define GPIO_PIDR_PIN7                                 (0x80U)

/*  Bit definition for GPIO_PODR register  */
#define GPIO_PODR_POUT0_POS                            (0U)
#define GPIO_PODR_POUT0                                (0x01U)
#define GPIO_PODR_POUT1_POS                            (1U)
#define GPIO_PODR_POUT1                                (0x02U)
#define GPIO_PODR_POUT2_POS                            (2U)
#define GPIO_PODR_POUT2                                (0x04U)
#define GPIO_PODR_POUT3_POS                            (3U)
#define GPIO_PODR_POUT3                                (0x08U)
#define GPIO_PODR_POUT4_POS                            (4U)
#define GPIO_PODR_POUT4                                (0x10U)
#define GPIO_PODR_POUT5_POS                            (5U)
#define GPIO_PODR_POUT5                                (0x20U)
#define GPIO_PODR_POUT6_POS                            (6U)
#define GPIO_PODR_POUT6                                (0x40U)
#define GPIO_PODR_POUT7_POS                            (7U)
#define GPIO_PODR_POUT7                                (0x80U)

/*  Bit definition for GPIO_POER register  */
#define GPIO_POER_POUTE0_POS                           (0U)
#define GPIO_POER_POUTE0                               (0x01U)
#define GPIO_POER_POUTE1_POS                           (1U)
#define GPIO_POER_POUTE1                               (0x02U)
#define GPIO_POER_POUTE2_POS                           (2U)
#define GPIO_POER_POUTE2                               (0x04U)
#define GPIO_POER_POUTE3_POS                           (3U)
#define GPIO_POER_POUTE3                               (0x08U)
#define GPIO_POER_POUTE4_POS                           (4U)
#define GPIO_POER_POUTE4                               (0x10U)
#define GPIO_POER_POUTE5_POS                           (5U)
#define GPIO_POER_POUTE5                               (0x20U)
#define GPIO_POER_POUTE6_POS                           (6U)
#define GPIO_POER_POUTE6                               (0x40U)
#define GPIO_POER_POUTE7_POS                           (7U)
#define GPIO_POER_POUTE7                               (0x80U)

/*  Bit definition for GPIO_POSR register  */
#define GPIO_POSR_POS0_POS                             (0U)
#define GPIO_POSR_POS0                                 (0x01U)
#define GPIO_POSR_POS1_POS                             (1U)
#define GPIO_POSR_POS1                                 (0x02U)
#define GPIO_POSR_POS2_POS                             (2U)
#define GPIO_POSR_POS2                                 (0x04U)
#define GPIO_POSR_POS3_POS                             (3U)
#define GPIO_POSR_POS3                                 (0x08U)
#define GPIO_POSR_POS4_POS                             (4U)
#define GPIO_POSR_POS4                                 (0x10U)
#define GPIO_POSR_POS5_POS                             (5U)
#define GPIO_POSR_POS5                                 (0x20U)
#define GPIO_POSR_POS6_POS                             (6U)
#define GPIO_POSR_POS6                                 (0x40U)
#define GPIO_POSR_POS7_POS                             (7U)
#define GPIO_POSR_POS7                                 (0x80U)

/*  Bit definition for GPIO_PORR register  */
#define GPIO_PORR_POR0_POS                             (0U)
#define GPIO_PORR_POR0                                 (0x01U)
#define GPIO_PORR_POR1_POS                             (1U)
#define GPIO_PORR_POR1                                 (0x02U)
#define GPIO_PORR_POR2_POS                             (2U)
#define GPIO_PORR_POR2                                 (0x04U)
#define GPIO_PORR_POR3_POS                             (3U)
#define GPIO_PORR_POR3                                 (0x08U)
#define GPIO_PORR_POR4_POS                             (4U)
#define GPIO_PORR_POR4                                 (0x10U)
#define GPIO_PORR_POR5_POS                             (5U)
#define GPIO_PORR_POR5                                 (0x20U)
#define GPIO_PORR_POR6_POS                             (6U)
#define GPIO_PORR_POR6                                 (0x40U)
#define GPIO_PORR_POR7_POS                             (7U)
#define GPIO_PORR_POR7                                 (0x80U)

/*  Bit definition for GPIO_POTR register  */
#define GPIO_POTR_POT0_POS                             (0U)
#define GPIO_POTR_POT0                                 (0x01U)
#define GPIO_POTR_POT1_POS                             (1U)
#define GPIO_POTR_POT1                                 (0x02U)
#define GPIO_POTR_POT2_POS                             (2U)
#define GPIO_POTR_POT2                                 (0x04U)
#define GPIO_POTR_POT3_POS                             (3U)
#define GPIO_POTR_POT3                                 (0x08U)
#define GPIO_POTR_POT4_POS                             (4U)
#define GPIO_POTR_POT4                                 (0x10U)
#define GPIO_POTR_POT5_POS                             (5U)
#define GPIO_POTR_POT5                                 (0x20U)
#define GPIO_POTR_POT6_POS                             (6U)
#define GPIO_POTR_POT6                                 (0x40U)
#define GPIO_POTR_POT7_POS                             (7U)
#define GPIO_POTR_POT7                                 (0x80U)

/*  Bit definition for GPIO_PCR register  */
#define GPIO_PCR_POUT_POS                              (0U)
#define GPIO_PCR_POUT                                  (0x0001U)
#define GPIO_PCR_POUTE_POS                             (1U)
#define GPIO_PCR_POUTE                                 (0x0002U)
#define GPIO_PCR_NOD_POS                               (2U)
#define GPIO_PCR_NOD                                   (0x0004U)
#define GPIO_PCR_DRV_POS                               (4U)
#define GPIO_PCR_DRV                                   (0x0010U)
#define GPIO_PCR_LTE_POS                               (5U)
#define GPIO_PCR_LTE                                   (0x0020U)
#define GPIO_PCR_PUU_POS                               (6U)
#define GPIO_PCR_PUU                                   (0x0040U)
#define GPIO_PCR_PIN_POS                               (8U)
#define GPIO_PCR_PIN                                   (0x0100U)
#define GPIO_PCR_INVE_POS                              (9U)
#define GPIO_PCR_INVE                                  (0x0200U)
#define GPIO_PCR_CINSEL_POS                            (10U)
#define GPIO_PCR_CINSEL                                (0x0400U)
#define GPIO_PCR_INTE_POS                              (11U)
#define GPIO_PCR_INTE                                  (0x0800U)
#define GPIO_PCR_FSEL_POS                              (12U)
#define GPIO_PCR_FSEL                                  (0x7000U)

/*  Bit definition for GPIO_PSPCR register  */
#define GPIO_PSPCR_SPFE                                (0x0003U)
#define GPIO_PSPCR_SPFE_0                              (0x0001U)
#define GPIO_PSPCR_SPFE_1                              (0x0002U)

