MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F115H8TH/mcu.h
/*******************************************************************************
                Bit definition for Peripheral INTC
*******************************************************************************/
/*  Bit definition for INTC_NMICR register  */
#define INTC_NMICR_NMITRG_POS                          (0U)
#define INTC_NMICR_NMITRG                              (0x00000001UL)
#define INTC_NMICR_NMIFCLK_POS                         (4U)
#define INTC_NMICR_NMIFCLK                             (0x00000030UL)
#define INTC_NMICR_NMIFCLK_0                           (0x00000010UL)
#define INTC_NMICR_NMIFCLK_1                           (0x00000020UL)
#define INTC_NMICR_NMIFEN_POS                          (7U)
#define INTC_NMICR_NMIFEN                              (0x00000080UL)

/*  Bit definition for INTC_NMIENR register  */
#define INTC_NMIENR_NMIEN_POS                          (0U)
#define INTC_NMIENR_NMIEN                              (0x00000001UL)
#define INTC_NMIENR_XTALSTPEN_POS                      (1U)
#define INTC_NMIENR_XTALSTPEN                          (0x00000002UL)
#define INTC_NMIENR_SWDTEN_POS                         (2U)
#define INTC_NMIENR_SWDTEN                             (0x00000004UL)
#define INTC_NMIENR_PVDEN_POS                          (3U)
#define INTC_NMIENR_PVDEN                              (0x00000008UL)

/*  Bit definition for INTC_NMIFR register  */
#define INTC_NMIFR_NMIF_POS                            (0U)
#define INTC_NMIFR_NMIF                                (0x00000001UL)
#define INTC_NMIFR_XTALSTPF_POS                        (1U)
#define INTC_NMIFR_XTALSTPF                            (0x00000002UL)
#define INTC_NMIFR_SWDTF_POS                           (2U)
#define INTC_NMIFR_SWDTF                               (0x00000004UL)
#define INTC_NMIFR_PVDF_POS                            (3U)
#define INTC_NMIFR_PVDF                                (0x00000008UL)

/*  Bit definition for INTC_NMICLR register  */
#define INTC_NMICLR_NMICL_POS                          (0U)
#define INTC_NMICLR_NMICL                              (0x00000001UL)
#define INTC_NMICLR_XTALSTPCL_POS                      (1U)
#define INTC_NMICLR_XTALSTPCL                          (0x00000002UL)
#define INTC_NMICLR_SWDTCL_POS                         (2U)
#define INTC_NMICLR_SWDTCL                             (0x00000004UL)
#define INTC_NMICLR_PVDCL_POS                          (3U)
#define INTC_NMICLR_PVDCL                              (0x00000008UL)

/*  Bit definition for INTC_EVTER register  */
#define INTC_EVTER_EVTEN0_POS                          (0U)
#define INTC_EVTER_EVTEN0                              (0x00000001UL)
#define INTC_EVTER_EVTEN1_POS                          (1U)
#define INTC_EVTER_EVTEN1                              (0x00000002UL)
#define INTC_EVTER_EVTEN2_POS                          (2U)
#define INTC_EVTER_EVTEN2                              (0x00000004UL)
#define INTC_EVTER_EVTEN3_POS                          (3U)
#define INTC_EVTER_EVTEN3                              (0x00000008UL)
#define INTC_EVTER_EVTEN4_POS                          (4U)
#define INTC_EVTER_EVTEN4                              (0x00000010UL)
#define INTC_EVTER_EVTEN5_POS                          (5U)
#define INTC_EVTER_EVTEN5                              (0x00000020UL)
#define INTC_EVTER_EVTEN6_POS                          (6U)
#define INTC_EVTER_EVTEN6                              (0x00000040UL)
#define INTC_EVTER_EVTEN7_POS                          (7U)
#define INTC_EVTER_EVTEN7                              (0x00000080UL)

/*  Bit definition for INTC_EKEYCR register  */
#define INTC_EKEYCR_EKEY0EN_POS                        (0U)
#define INTC_EKEYCR_EKEY0EN                            (0x00000001UL)
#define INTC_EKEYCR_EKEY1EN_POS                        (1U)
#define INTC_EKEYCR_EKEY1EN                            (0x00000002UL)
#define INTC_EKEYCR_EKEY2EN_POS                        (2U)
#define INTC_EKEYCR_EKEY2EN                            (0x00000004UL)
#define INTC_EKEYCR_EKEY3EN_POS                        (3U)
#define INTC_EKEYCR_EKEY3EN                            (0x00000008UL)
#define INTC_EKEYCR_EKEY4EN_POS                        (4U)
#define INTC_EKEYCR_EKEY4EN                            (0x00000010UL)
#define INTC_EKEYCR_EKEY5EN_POS                        (5U)
#define INTC_EKEYCR_EKEY5EN                            (0x00000020UL)

/*  Bit definition for INTC_FPRCR register  */
#define INTC_FPRCR_FPRC                                (0x000000FFUL)
#define INTC_FPRCR_FPRC_0                              (0x00000001UL)
#define INTC_FPRCR_FPRC_1                              (0x00000002UL)
#define INTC_FPRCR_FPRC_2                              (0x00000004UL)
#define INTC_FPRCR_FPRC_3                              (0x00000008UL)
#define INTC_FPRCR_FPRC_4                              (0x00000010UL)
#define INTC_FPRCR_FPRC_5                              (0x00000020UL)
#define INTC_FPRCR_FPRC_6                              (0x00000040UL)
#define INTC_FPRCR_FPRC_7                              (0x00000080UL)

/*  Bit definition for INTC_EIRQCR register  */
#define INTC_EIRQCR_EIRQTRG_POS                        (0U)
#define INTC_EIRQCR_EIRQTRG                            (0x00000003UL)
#define INTC_EIRQCR_EIRQTRG_0                          (0x00000001UL)
#define INTC_EIRQCR_EIRQTRG_1                          (0x00000002UL)
#define INTC_EIRQCR_EIRQFCLK_POS                       (4U)
#define INTC_EIRQCR_EIRQFCLK                           (0x00000030UL)
#define INTC_EIRQCR_EIRQFCLK_0                         (0x00000010UL)
#define INTC_EIRQCR_EIRQFCLK_1                         (0x00000020UL)
#define INTC_EIRQCR_EIRQFEN_POS                        (7U)
#define INTC_EIRQCR_EIRQFEN                            (0x00000080UL)

/*  Bit definition for INTC_WUPEN register  */
#define INTC_WUPEN_EIRQWUEN_POS                        (0U)
#define INTC_WUPEN_EIRQWUEN                            (0x000003FFUL)
#define INTC_WUPEN_EIRQWUEN_0                          (0x00000001UL)
#define INTC_WUPEN_EIRQWUEN_1                          (0x00000002UL)
#define INTC_WUPEN_EIRQWUEN_2                          (0x00000004UL)
#define INTC_WUPEN_EIRQWUEN_3                          (0x00000008UL)
#define INTC_WUPEN_EIRQWUEN_4                          (0x00000010UL)
#define INTC_WUPEN_EIRQWUEN_5                          (0x00000020UL)
#define INTC_WUPEN_EIRQWUEN_6                          (0x00000040UL)
#define INTC_WUPEN_EIRQWUEN_7                          (0x00000080UL)
#define INTC_WUPEN_EIRQWUEN_8                          (0x00000100UL)
#define INTC_WUPEN_EIRQWUEN_9                          (0x00000200UL)
#define INTC_WUPEN_SWDTWUEN_POS                        (16U)
#define INTC_WUPEN_SWDTWUEN                            (0x00010000UL)
#define INTC_WUPEN_EKEYWUEN_POS                        (17U)
#define INTC_WUPEN_EKEYWUEN                            (0x00020000UL)
#define INTC_WUPEN_TMR0CMPWUEN_POS                     (18U)
#define INTC_WUPEN_TMR0CMPWUEN                         (0x00040000UL)
#define INTC_WUPEN_PVDWUEN_POS                         (22U)
#define INTC_WUPEN_PVDWUEN                             (0x00400000UL)
#define INTC_WUPEN_RTCALMWUEN_POS                      (23U)
#define INTC_WUPEN_RTCALMWUEN                          (0x00800000UL)
#define INTC_WUPEN_RTCPRDWUEN_POS                      (24U)
#define INTC_WUPEN_RTCPRDWUEN                          (0x01000000UL)

/*  Bit definition for INTC_EIRQFR register  */
#define INTC_EIRQFR_EIRQF                              (0x000003FFUL)
#define INTC_EIRQFR_EIRQF_0                            (0x00000001UL)
#define INTC_EIRQFR_EIRQF_1                            (0x00000002UL)
#define INTC_EIRQFR_EIRQF_2                            (0x00000004UL)
#define INTC_EIRQFR_EIRQF_3                            (0x00000008UL)
#define INTC_EIRQFR_EIRQF_4                            (0x00000010UL)
#define INTC_EIRQFR_EIRQF_5                            (0x00000020UL)
#define INTC_EIRQFR_EIRQF_6                            (0x00000040UL)
#define INTC_EIRQFR_EIRQF_7                            (0x00000080UL)
#define INTC_EIRQFR_EIRQF_8                            (0x00000100UL)
#define INTC_EIRQFR_EIRQF_9                            (0x00000200UL)

