MikroElektronika/core_packages/ARM/gcc_clang/def/hdsc/HC32F115H8TH/mcu.h
typedef struct {
    stc_crc_cr_bit_t                         CR_b;
} bCM_CRC_TypeDef;

typedef struct {
    stc_ctc_cr1_bit_t                        CR1_b;
    uint32_t                                 RESERVED0[32];
    stc_ctc_str_bit_t                        STR_b;
} bCM_CTC_TypeDef;

typedef struct {
    stc_dbgc_mcudbgstat_bit_t                MCUDBGSTAT_b;
    stc_dbgc_mcustpctl_bit_t                 MCUSTPCTL_b;
} bCM_DBGC_TypeDef;

typedef struct {
    uint32_t                                 RESERVED0[32];
    stc_efm_fstp_bit_t                       FSTP_b;
    stc_efm_frmc_bit_t                       FRMC_b;
    stc_efm_fwmc_bit_t                       FWMC_b;
    stc_efm_fsr_bit_t                        FSR_b;
    stc_efm_fsclr_bit_t                      FSCLR_b;
    stc_efm_fite_bit_t                       FITE_b;
    uint32_t                                 RESERVED1[4928];
    stc_efm_lvdicgcr_bit_t                   LVDICGCR_b;
} bCM_EFM_TypeDef;

typedef struct {
    stc_gpio_pidr_bit_t                      PIDR0_b;
    stc_gpio_pidr_bit_t                      PIDR1_b;
    stc_gpio_pidr_bit_t                      PIDR2_b;
    stc_gpio_pidr_bit_t                      PIDR3_b;
    stc_gpio_pidr_bit_t                      PIDR4_b;
    stc_gpio_pidr_bit_t                      PIDR5_b;
    stc_gpio_pidr_bit_t                      PIDR6_b;
    stc_gpio_pidr_bit_t                      PIDR7_b;
    uint32_t                                 RESERVED0[32];
    stc_gpio_pidr_bit_t                      PIDR12_b;
    stc_gpio_pidr_bit_t                      PIDR13_b;
    stc_gpio_pidr_bit_t                      PIDR14_b;
    uint32_t                                 RESERVED1[8];
    stc_gpio_podr_bit_t                      PODR0_b;
    stc_gpio_podr_bit_t                      PODR1_b;
    stc_gpio_podr_bit_t                      PODR2_b;
    stc_gpio_podr_bit_t                      PODR3_b;
    stc_gpio_podr_bit_t                      PODR4_b;
    stc_gpio_podr_bit_t                      PODR5_b;
    stc_gpio_podr_bit_t                      PODR6_b;
    stc_gpio_podr_bit_t                      PODR7_b;
    uint32_t                                 RESERVED2[32];
    stc_gpio_podr_bit_t                      PODR12_b;
    stc_gpio_podr_bit_t                      PODR13_b;
    stc_gpio_podr_bit_t                      PODR14_b;
    uint32_t                                 RESERVED3[8];
    stc_gpio_poer_bit_t                      POER0_b;
    stc_gpio_poer_bit_t                      POER1_b;
    stc_gpio_poer_bit_t                      POER2_b;
    stc_gpio_poer_bit_t                      POER3_b;
    stc_gpio_poer_bit_t                      POER4_b;
    stc_gpio_poer_bit_t                      POER5_b;
    stc_gpio_poer_bit_t                      POER6_b;
    stc_gpio_poer_bit_t                      POER7_b;
    uint32_t                                 RESERVED4[32];
    stc_gpio_poer_bit_t                      POER12_b;
    stc_gpio_poer_bit_t                      POER13_b;
    stc_gpio_poer_bit_t                      POER14_b;
    uint32_t                                 RESERVED5[8];
    stc_gpio_posr_bit_t                      POSR0_b;
    stc_gpio_posr_bit_t                      POSR1_b;
    stc_gpio_posr_bit_t                      POSR2_b;
    stc_gpio_posr_bit_t                      POSR3_b;
    stc_gpio_posr_bit_t                      POSR4_b;
    stc_gpio_posr_bit_t                      POSR5_b;
    stc_gpio_posr_bit_t                      POSR6_b;
    stc_gpio_posr_bit_t                      POSR7_b;
    uint32_t                                 RESERVED6[32];
    stc_gpio_posr_bit_t                      POSR12_b;
    stc_gpio_posr_bit_t                      POSR13_b;
    stc_gpio_posr_bit_t                      POSR14_b;
    uint32_t                                 RESERVED7[8];
    stc_gpio_porr_bit_t                      PORR0_b;
    stc_gpio_porr_bit_t                      PORR1_b;
    stc_gpio_porr_bit_t                      PORR2_b;
    stc_gpio_porr_bit_t                      PORR3_b;
    stc_gpio_porr_bit_t                      PORR4_b;
    stc_gpio_porr_bit_t                      PORR5_b;
    stc_gpio_porr_bit_t                      PORR6_b;
    stc_gpio_porr_bit_t                      PORR7_b;
    uint32_t                                 RESERVED8[32];
    stc_gpio_porr_bit_t                      PORR12_b;
    stc_gpio_porr_bit_t                      PORR13_b;
    stc_gpio_porr_bit_t                      PORR14_b;
    uint32_t                                 RESERVED9[8];
    stc_gpio_potr_bit_t                      POTR0_b;
    stc_gpio_potr_bit_t                      POTR1_b;
    stc_gpio_potr_bit_t                      POTR2_b;
    stc_gpio_potr_bit_t                      POTR3_b;
    stc_gpio_potr_bit_t                      POTR4_b;
    stc_gpio_potr_bit_t                      POTR5_b;
    stc_gpio_potr_bit_t                      POTR6_b;
    stc_gpio_potr_bit_t                      POTR7_b;
    uint32_t                                 RESERVED10[32];
    stc_gpio_potr_bit_t                      POTR12_b;
    stc_gpio_potr_bit_t                      POTR13_b;
    stc_gpio_potr_bit_t                      POTR14_b;
    uint32_t                                 RESERVED11[7432];
    stc_gpio_pcr_bit_t                       PCR00_b;
    stc_gpio_pcr_bit_t                       PCR01_b;
    uint32_t                                 RESERVED12[96];
    stc_gpio_pcr_bit_t                       PCR10_b;
    stc_gpio_pcr_bit_t                       PCR11_b;
    stc_gpio_pcr_bit_t                       PCR12_b;
    stc_gpio_pcr_bit_t                       PCR13_b;
    stc_gpio_pcr_bit_t                       PCR14_b;
    stc_gpio_pcr_bit_t                       PCR15_b;
    stc_gpio_pcr_bit_t                       PCR16_b;
    stc_gpio_pcr_bit_t                       PCR17_b;
    stc_gpio_pcr_bit_t                       PCR20_b;
    stc_gpio_pcr_bit_t                       PCR21_b;
    stc_gpio_pcr_bit_t                       PCR22_b;
    stc_gpio_pcr_bit_t                       PCR23_b;
    stc_gpio_pcr_bit_t                       PCR24_b;
    stc_gpio_pcr_bit_t                       PCR25_b;
    stc_gpio_pcr_bit_t                       PCR26_b;
    stc_gpio_pcr_bit_t                       PCR27_b;
    stc_gpio_pcr_bit_t                       PCR30_b;
    stc_gpio_pcr_bit_t                       PCR31_b;
    uint32_t                                 RESERVED13[96];
    stc_gpio_pcr_bit_t                       PCR40_b;
    stc_gpio_pcr_bit_t                       PCR41_b;
    uint32_t                                 RESERVED14[96];
    stc_gpio_pcr_bit_t                       PCR50_b;
    stc_gpio_pcr_bit_t                       PCR51_b;
    uint32_t                                 RESERVED15[96];
    stc_gpio_pcr_bit_t                       PCR60_b;
    stc_gpio_pcr_bit_t                       PCR61_b;
    stc_gpio_pcr_bit_t                       PCR62_b;
    stc_gpio_pcr_bit_t                       PCR63_b;
    uint32_t                                 RESERVED16[64];
    stc_gpio_pcr_bit_t                       PCR70_b;
    stc_gpio_pcr_bit_t                       PCR71_b;
    stc_gpio_pcr_bit_t                       PCR72_b;
    stc_gpio_pcr_bit_t                       PCR73_b;
    uint32_t                                 RESERVED17[576];
    stc_gpio_pcr_bit_t                       PCR120_b;
    stc_gpio_pcr_bit_t                       PCR121_b;
    stc_gpio_pcr_bit_t                       PCR122_b;
    stc_gpio_pcr_bit_t                       PCR123_b;
    stc_gpio_pcr_bit_t                       PCR124_b;
    uint32_t                                 RESERVED18[160];
    stc_gpio_pcr_bit_t                       PCR137_b;
    uint32_t                                 RESERVED19[96];
    stc_gpio_pcr_bit_t                       PCR146_b;
    stc_gpio_pcr_bit_t                       PCR147_b;
    uint32_t                                 RESERVED20[176];
    stc_gpio_pinaer_bit_t                    PINAER_b;
    stc_gpio_pwpr_bit_t                      PWPR_b;
} bCM_GPIO_TypeDef;

